import { Col, Container, Row } from "react-bootstrap";
import MyNavbar from "../../components/MyNavbar/MyNavbar";
import harry from "../../assets/images/harry.png";
import "./Home.css";
import Card from "../../components/Cards/Cards";
import { useState } from "react";
import Footer from "../../components/Footer/Footer";
import { GroupsData } from "../../groupsData";

function Home({}) {
  let [groups, setGroups] = useState(GroupsData);

  return (
    <>
      <MyNavbar />

      <Container className="text-align-center" fluid="md">
        <Row className="first-home-row">
          <Col className="col-sm-12 col-md-6 col-lg-8 first-col">
            <h1 className="p-4 pt-3 pb-3 h1-home">خلاصه داستان هری پاتر:</h1>
            <p
              className="description"
              style={{ textAlign: "justify", marginBottom: "10px" }}
            >
              هَری پاتِر (به انگلیسی: Harry Potter) مجموعه‌ای از هفت رمان فانتزی
              نوشتهٔ جی.کی. رولینگ، نویسندهٔ بریتانیایی است. این رمان‌ها شرح
              زندگی جادوگر جوانی به نام هری پاتر و دوستان و دشمنان مدرسه‌اش به
              ترتیب هرماینی گرنجر و رونالد ویزلی و درِیکو مالفوی است که همگی
              دانش‌آموزان مدرسه سحر و جادوگری هاگوارتز هستند. بخش اصلی داستان
              پیرامون تلاش و مبارزه هری برای غلبه بر جادوگر سیاه، لرد ولدمورت
              است که هدفش سرکوب کردن افراد غیر جادوگر (مشنگ‌ها)، تحت فرمان
              درآوردن دنیای جادوگران و نابود کردن همه کسانی است که در مقابل او
              ایستاده‌اند. اولین رمان از این مجموعه کتاب، در تاریخ ۳۰ ژوئن ۱۹۹۷
              با عنوان هری پاتر و سنگ جادو منتشر شد. داشته و به ۸۳ زبان دنیا
              ترجمه شده‌است.و چهار کتاب پایانی این مجموعه به‌طور متوالی رکورد
              فروش سریع‌ترین کتاب‌های جهان را دارد. هری پاتر یک مجموعه با چندین
              ژانر، از جمله فانتزی، گذر عمر (با عناصری رمزآلود، هیجان‌انگیز،
              ماجراجویی، عاشقانه، جادویی و خیالی) که دارای بسیاری از معانی
              فرهنگی و این ارجاعات است.بر اساس گفتهٔ رولینگ، موضوع اصلی داستان
              مرگ است، هر چند چیزی که در درجه اول در نظر گرفته می‌شود، کار
              ادبیات کودکان است. همچنین بسیاری از موضوعات دیگر در این سری، مانند
              عشق و تعصب وجود دارد.ناشران اصلی و اولیه از کتاب‌سرای بلومزبری در
              انگلستان و انتشارات اسکلاستیک در ایالات متحده می‌باشند، کتاب از آن
              زمان به بعد توسط بسیاری از ناشران در سراسر جهان منتشر شده‌است. در
              اکتبر ۲۰۱۱، این مجموعه در فرمت‌های مختلف کتاب از طریق «پاترمور»
              منتشر شد. کتاب‌ها به صورت مجموعه‌ای هشت قسمتی توسط شرکت برادران
              وارنر ساخته شده‌اند، که در این مجموعه کتاب هفتم در دو قسمت ساخته
              شده‌است. هری پاتر بالاترین مجموعه فیلم پرفروش در تمام دوران است.
              بازیگران اصلی این فیلم دنیل رادکلیف در نقش هری پاتر اما واتسون در
              نقش هرماینی گرنجر و روپرت گرینت در نقش رون ویزلی است. این مجموعه
              سرچشمه گرفته از چندین ابزار رسانه‌ای در کالا است. سود تجاری هری
              پاتر بیش از ۱۵ میلیارد دلار است.
            </p>
          </Col>
          <Col className="col-sm-12 col-md-6 col-lg-4 home-img-col">
            <img className="home-img img-fluid" alt="harry"  src={harry} />
          </Col>
        </Row>

        <Row className="mt-5 ">
          <h3 className="mb-5">گروپ های مکتب هاگوارتز:</h3>

          {groups.map((group) => (
            <Col key={group.id} className="py-3" lg={6} md={6} xl={3}>
              <Card {...group} />
            </Col>
          ))}
        </Row>
      </Container>

      <Footer />
    </>
  );
}
export default Home;
